{"author":["user"],"description":"Detects use of bash interpreter via auditd EXECVE logs","enabled":true,"false_positives":[],"from":"now-15m","index":["filebeat-*"],"interval":"5m","query":"message:*type=EXECVE* AND message:*a0=\\\"bash\\\"*","risk_score":50,"name":"Execution - Bash interpreter used","severity":"medium","tags":["MITRE ATT&CK","Execution","T1059.004"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1059.004","name":"Command and Scripting Interpreter: Bash","reference":"https://attack.mitre.org/techniques/T1059/004/"}]}],"type":"query","language":"kuery","version":1,"rule_id":"exec_bash_detect"}

