{"author":["user"],"description":"Detects login from a known valid account during abnormal hours or from unusual IP","enabled":true,"false_positives":[],"from":"now-6m","index":["filebeat-*"],"interval":"5m","query":"event.dataset: \"system.auth\" AND message: \"Accepted password\" AND source.ip: (NOT 192.168.*)","risk_score":70,"name":"Initial Access - Valid Account Abuse","severity":"high","tags":["MITRE ATT&CK","TA0001","T1078"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/"}]}],"type":"query","language":"kuery","version":1,"rule_id":"initialaccess_valid_accounts"}

