{"author": ["user"],"description": "Detect possible tool or malware download from suspicious domain","enabled": true,"false_positives": [],"from": "now-6m","index": ["filebeat-*","packetbeat-*"],"interval": "5m","query": "url.domain:*github.com* OR url.domain:*pastebin.com* OR message:*curl* OR message:*wget*","risk_score": 40,"name": "Resource Development - Suspicious Tool Download","severity": "medium","tags": ["MITRE ATT&CK", "resource development"],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0042","name": "Resource Development","reference": "https://attack.mitre.org/tactics/TA0042/"},"technique": [{"id": "T1583.001","name": "Acquire Infrastructure: Domains","reference": "https://attack.mitre.org/techniques/T1583/001/"}]}],"type": "query","language": "kuery","version": 1,"rule_id": "resource_dev_tool_download"}

